Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Here’s an example to print the results of the math functions from above:
ja: ここに上記の数学関数の結果を出力する例があります：

source: Here’s an example using the overflow subtraction operator (&-):
ja: ここにオーバフロー減算演算子（&-）を使った例があります：

source: Here’s an example, using the VideoMode class defined above:
ja: 上で定義されるVideoModeクラスを使用している例がここにあります：

source: Here’s an example, which calculates the height for a table row.
ja: ここにひとつの例があります、それはあるテーブルの列の高さを計算します。

source: Here’s an example.
ja: ここにひとつの例があります。

source: Here’s an example:
ja: ここにある例があります：

source: Here’s an expanded version of TwelveOrLess called SmallNumber that defines initializers that set the wrapped and maximum value:
ja: ここにある拡張されたバージョンのTwelveOrLess、SmallNumberと呼ばれるものがあります、それはラップされたそして最大限の値を設定するイニシャライザそれらを定義します：

source: Here’s an expanded version of the Celsius example from Initialization Parameters above, with an additional initializer to create a new Celsius instance from a Double value that is already in the Celsius scale:
ja: ここに上の初期化パラメータからのCelsius例の拡張版があります、それは追加のイニシャライザを使って、既に摂氏尺度であるDouble値から新しいCelsiusインスタンスを作ります。

source: Here’s an extension of the Stack type from Generic Types above that adds conformance to the SuffixableContainer protocol:
ja: ここに、上のGeneric TypesからのStack型の拡張があります、それはSuffixableContainerプロトコルへの準拠を加えます：

source: Here’s an implementation of a class that adopts and conforms to the RandomNumberGenerator protocol.
ja: RandomNumberGeneratorプロトコルを採用して準拠するクラスの実施が、ここにあります。

source: Here’s another example, for a function with no parameters or return value:
ja: もう１つの例がここにあります、パラメータおよび戻り値のないある関数です：

source: Here’s how DiceGameTracker looks in action:
ja: 動作中のDiceGameTrackerがどのように見えるかは、ここにあります：

source: Here’s how stackOfStrings looks after pushing these four values on to the stack:
ja: これらの４つの値をそのスタックにプッシュした後でstackOfStringsがどのように見えるかは、ここにあります：

source: Here’s how bit shifting looks in Swift code:
ja: ビットシフトがスウィフトコードにおいてどのように見えるかは、ここにあります：

source: Here’s how phase 1 looks for an initialization call for a hypothetical subclass and superclass:
ja: 第１段階がある仮定のサブクラスとスーパークラスのための初期化呼び出しを捜す方法がここにあります：

source: Here’s how phase 2 looks for the same initialization call:
ja: 第２段階が同じ初期化呼び出しを捜す方法は、ここにあります：

source: Here’s how the Dice class can be used to create a six-sided dice with a LinearCongruentialGenerator instance as its random number generator:
ja: Diceクラスが、６面のさいころをつくるためにその乱数生成器としてLinearCongruentialGeneratorインスタンスをつかってどのように使われることができるかが、ここにあります：

source: Here’s how the allItemsMatch(_:_:) function looks in action:
ja: 動作中のallItemsMatch(_:_:)関数がどのように見えるかが、ここにあります：

source: Here’s how the isTop(_:) method looks in action:
ja: 動作中のisTop(_:)メソッドがどのように見えるかが、ここにあります：

source: Here’s how the bits inside an Int8 look for the number -4:
ja: Int8内のビットが数-4に対してどのように見えるかは、ここにあります：

source: Here’s how the bits inside an Int8 look for the number 4:
ja: Int8内のビットが数4に対してどのように見えるかは、ここにあります：

source: Here’s how the cycle looks:
ja: 循環がどのように見えるかは、ここにあります：

source: Here’s how the first lines compare:
ja: 最初の行がどのくらい似ているかが、ここにあります：

source: Here’s how the method looks:
ja: どのようにそのメソッドが見えるかは、ここにあります：

source: Here’s how the references look now that you’ve linked the two instances together:
ja: あなたが２つのインスタンスを結びつけた今、参照がどのように見えるかは、ここにあります：

source: Here’s how the references look with the capture list in place:
ja: 捕獲リストで適切にされた参照がどのように見えるかは、ここにあります：

source: Here’s how the references look, now that you’ve linked the two instances:
ja: あなたが２つのインスタンスを結んだ今、これらの参照がどのように見えるかは、ここにあります：

source: Here’s how the remainder operator works.
ja: ここに剰余演算子が機能する方法があります。

source: Here’s how the stack looks after popping its top value:
ja: スタックがその一番上の値をポップした後にどう見えるかは、ここにあります：

source: Here’s how the strong references look after creating and assigning these two instances.
ja: それらの２つのインスタンスの作成と代入の後に強い参照がどのように見えるかが、ここにあります。

source: Here’s how the strong references look after you link the two instances together:
ja: あなたが２つのインスタンスを結びつけた後に強い参照がどのように見えるかが、ここにあります。

source: Here’s how the strong references look after you set the john and unit4A variables to nil:
ja: あなたがjohnとunit4A変数をnilに設定したあと、強い参照がどのように見えるかは、ここにあります：

source: Here’s how to write a nongeneric version of a stack, in this case for a stack of Int values:
ja: スタックの非総称体版を書く方法がここにあります、これはInt値のスタックの場合です：

source: Here’s how two-phase initialization plays out, based on the four safety checks above:
ja: ２段階初期化が、上の４つの安全点検に基づいて最後までやり終える方法がここにあります：

source: Here’s how you call a type method on a class called SomeClass:
ja: あなたが型メソッドをSomeClassと呼ばれるクラスの上で呼び出す方法がここにあります：

source: Here’s how you can use the map(_:) method with a trailing closure to convert an array of Int values into an array of String values.
ja: ここに、あなたがInt値の配列をString値の配列に変えるために後付クロージャとともにmap(_:)メソッドをどのように使用できるかがあります。

source: Here’s how you might expect a generic version of findIndex(ofString:in:), called findIndex(of:in:), to be written.
ja: あなたが予想するfindIndex(ofString:in:)の総称体版、findIndex(of:in:)と呼ばれるものが書かれる方法はここにあります。

source: Here’s how you use the HTMLElement class to create and print a new instance:
ja: あなたが新しいインスタンスを作成して出力するためにHTMLElementクラスを使用する方法は、ここにあります：

source: Here’s how you write that:
ja: あなたがそれをどう書くかここにあります：

source: Here’s how you write the HTMLElement class to avoid the cycle:
ja: ここに、あなたがHTMLElementクラスを循環を避けるように書く方法があります：

source: Here’s the Snakes and Ladders example again, written as a repeat-while loop rather than a while loop.
ja: ここに再び「ヘビとはしご」の例があります、それはrepeat-whileループとして書かれます、whileループではなく。

source: Here’s the general form of a repeat-while loop:
ja: repeat-whileループの一般的な形式は、ここにあります：

source: Here’s the general form of a while loop:
ja: whileループの一般的な形式は、ここにあります：

source: Here’s the initial array to be sorted:
ja: 分類される最初の配列は、ここにあります：

source: Hexadecimal floating-point literals consist of a 0x prefix, followed by an optional hexadecimal fraction, followed by a hexadecimal exponent.
ja: 16進の浮動小数点リテラルは、0x接頭辞、続けて任意の16進の小数部、それに続く16進の指数から成ります。

source: Hiding type information is useful at boundaries between a module and code that calls into the module, because the underlying type of the return value can remain private.
ja: 型情報を隠すことは、あるモジュールとモジュールへと呼び出しをするコードとの間の境界で役立ちます、なぜなら戻り値のその基礎をなす型は、プライベートのままであることが可能だからです。

source: Higher-precedence operators are evaluated before lower-precedence ones.
ja: より高い優先順位の演算子は、より低い優先順位のもの前に評価されます。

# Horizontal tab ( )
source: Horizontal tab (\t)
ja: 水平タブ（\t）

source: How ARC Works
ja: ARCは、どのように働きますか

source: How Deinitialization Works
ja: デイニシャライズはどのように働くか

source: How to Read the Grammar
ja: この文法を読む方法

source: However, (a: 10, b: (a: 1, x: 2)) is valid—although a appears twice, it appears once in the outer tuple and once in the inner tuple.
ja: しかしながら、(a: 10, b: (a: 1, x: 2))は有効です — もっともaが二度現れますが、それは一度だけ外側タプルに、そして一度だけ内側タプルに現れます。

source: However, Swift structures and classes are much closer in functionality than in other languages, and much of this chapter describes functionality that applies to instances of either a class or a structure type.
ja: しかし、スウィフトの構造体とクラスは他の言語においてよりも機能性において非常に近いものです、したがってこの章の多くはクラスまたは構造体型の両方のインスタンスに適用される機能性を記述します。

source: However, a method marked with the objc attribute can override a method marked with the nonobjc attribute.
ja: しかしながら、objc属性で印されるメソッドはnonobjc属性で印されるメソッドをオーバーライドすることができます。

source: However, a unit test target can access any internal entity, if you mark the import declaration for a product module with the @testable attribute and compile that product module with testing enabled.
ja: しかしながら、あなたが製品モジュールのためのインポート宣言を@testable属性で印して、その製品モジュールをテスト可能な状態にコンパイルするならば、ユニットテストターゲットはあらゆる内部実在にアクセス可能です。

source: However, a value of a protocol type doesn’t conform to that protocol; the value returned by protoFlip(_:) doesn’t conform to Shape.
ja: しかしながら、あるプロトコル型からなるある値は、そのプロトコルに準拠しません；protoFlip(_:)によって返される値は、Shapeに準拠しません。

source: However, adding parentheses around a type doesn’t have any effect.
ja: けれども、ある型の周りに丸括弧を加えることは全く影響はありません。

source: However, at the point that they’re stored in the objectWithArea constant, they’re only known to be of type HasArea, and so only their area property can be accessed.
ja: しかし、それらが定数のobjectWithAreaに格納される時点で、それらは型HasAreaであるということを知られているだけです、なので、それらのareaプロパティだけがアクセスされることができます。

source: However, avoid using keywords as names unless you have absolutely no choice.
ja: しかし、あなたに選択が全くない場合を除き、キーワードをなんらかの名前として使用することを避けてください。

source: However, because asHTML is a closure property rather than an instance method, you can replace the default value of the asHTML property with a custom closure, if you want to change the HTML rendering for a particular HTML element.
ja: しかし、asHTMLはインスタンスメソッドではなくクロージャプロパティであるので、あなたが特定のHTML要素に対してHTML解釈を変更したいならば、あなたはあつらえのクロージャでasHTMLプロパティの省略時の値を置き替えることができます。

source: However, because it’s called with a string constant, you can see that the initializer won’t fail, so no runtime error can occur in this case.
ja: しかしながら、それは文字列定数で呼び出されるので、あなたはこのイニシャライザが失敗することはないと分かります、それで実行時エラーはこの場合には起こりえません。

source: However, because of Swift’s type inference, you don’t have to write the type of the set’s elements if you’re initializing it with an array literal that contains values of just one type.
ja: しかしながら、スウィフトのもつ型推論のために、あなたは集合の持つ要素それらの型を書くことは、あなたがそれをただ１つの型だけの値それらを含む配列リテラルを使って初期化しているならば、必要ありません。

source: However, because the closure refers to self within its body (as a way to reference self.name and self.text), the closure captures self, which means that it holds a strong reference back to the HTMLElement instance.
ja: しかし、クロージャがその本文内でselfに言及する（self.nameとself.textを参照する方法として）ので、クロージャはselfを捕獲します、それは、今度は逆にそれがHTMLElementインスタンスへの強い参照を保持することを意味します。

source: However, because they are separate instances, setting the width of cinema to 2048 doesn’t affect the width stored in hd, as shown in the figure below:
ja: しかしながら、それらが別々のインスタンスであるので、cinemaの幅を2048に設定することはhdに格納される幅に影響を及ぼしません、下の図で示されるように：

source: However, before you learn how to break a strong reference cycle with a closure capture list, it’s useful to understand how such a cycle can be caused.
ja: しかし、あなたがクロージャ捕獲リストで強い参照循環を壊す方法を学ぶ前に、そのような循環がどのように引き起こされることがありえるか理解することは役に立ちます。

source: However, before you learn how to resolve a strong reference cycle, it’s useful to understand how such a cycle is caused.
ja: しかし、あなたが強い参照循環を解消する方法を学ぶ前に、そのような循環がどのように引き起こされるか理解することは役に立ちます。

source: However, code outside the module might still be able to interact with the declaration’s symbol by using runtime behavior.
ja: しかしながら、モジュール外部のコードは、依然として宣言のシンボルと実行時挙動を使うことによって相互作用可能かもしれません。

source: However, constant type properties of a class are an exception: static has its normal, nonclass meaning there because you can’t write class or final on those declarations.
ja: しかしながら、クラスの定数型プロパティは例外です：staticはそれの通常の、非クラスの意味をそこで持ちません、なぜならあなたはclassまたはfinalをそれらの宣言上で書けないからです。

source: However, for the inline closure expression, the parameters and return type are written inside the curly braces, not outside of them.
ja: しかし、行内クロージャ式のために、パラメータと戻り型は、波括弧の内側に書かれます、その外側ではなく。

source: However, functions and methods with no return type have an implicit return type of Void, as described in Functions Without Return Values.
ja: しかし、戻り値のない関数で記述されるように、戻り型のない関数やメソッドは、Voidの暗黙の戻り型を持ちます。

source: However, if ARC were to deallocate an instance that was still in use, it would no longer be possible to access that instance’s properties, or call that instance’s methods.
ja: しかし、ARCがまだ使用中だったインスタンスの割り当て解除をすることになったならば、そのインスタンスのプロパティにアクセスすることや、そのインスタンスのメソッドを呼ぶことは、もはや可能でないでしょう。

source: However, if multiple matches are possible, the first matching case is always used.
ja: しかし、複数の適合が出来るならば、最初の適合するケース節が常に使われます。

source: However, if you apply both a prefix and a postfix operator to the same operand, the postfix operator is applied first.
ja: しかし、あなたが接頭辞演算子と接尾辞演算子の両方を同じ演算数を適用したならば、接尾辞演算子が最初に適用されます。

source: However, if you iterate over the contents of this array, the items you receive back are typed as MediaItem, and not as Movie or Song.
ja: しかし、あなたがこの配列の内容上に繰り返すならば、あなたがそこから取り出す項目は、MediaItem型としてであって、MovieまたはSongではありません。

source: However, if you need to modify the properties of your structure or enumeration within a particular method, you can opt in to mutating behavior for that method.
ja: しかし、あなたがある特定のメソッド内であなたの構造体または列挙のプロパティを修正する必要があるならば、あなたはそのメソッドのために可変挙動を選ぶことができます。

source: However, if you pass oscar as the argument to shareHealth(with:), there’s a conflict:
ja: しかしながら、あなたがoscarを引数としてshareHealth(with:)に渡すならば、衝突が存在します。

source: However, if you write whitespace at the beginning of a line in addition to what’s before the closing quotation marks, that whitespace is included.
ja: しかしながら、あなたが終了引用符の前のものに加えて空白文字をある行の始まりで書くならば、その空白文字は含められます。

source: However, in a few cases ARC requires more information about the relationships between parts of your code in order to manage memory for you.
ja: しかし、２、３の場合には、ARCは、あなたのためにメモリを管理するために、あなたのコードの部分間の関係に関するより多くの情報を要求します。

source: However, initializers do not have an identifying function name before their parentheses in the way that functions and methods do.
ja: しかし、イニシャライザは、関数とメソッドがするように識別する関数名をその括弧の前に持ちません。

source: However, instances of enumeration types have value semantics, which means they have a fixed layout in memory.
ja: しかしながら、列挙型のインスタンスは値意味論を持ちます、それは、それらがメモリにおいてある固定された配置を持つことを意味します。

source: However, it is more convenient (and clearer in intent) for the init(center:size:) initializer to take advantage of an existing initializer that already provides exactly that functionality.
ja: しかし、すでに正確にその機能性を提供する既存のイニシャライザを利用するほうが、init(center:size:)イニシャライザにとってより便利です（そして意図においてより明白です）。

source: However, it is not appropriate for an animal to have an empty string as the value of its species property.
ja: しかしながら、ある動物にとってそれのspecies（種族）プロパティの値として空の文字列を持つことはふさわしくありません。

source: However, it is sometimes useful to write shorter versions of function-like constructs without a full declaration and name.
ja: しかし、まるまる完全な宣言や名前なしに、関数のような構造物のより短いものをいろいろと書くことは、時々役に立ちます。

source: However, its behavior in Swift for negative numbers means that, strictly speaking, it’s a remainder rather than a modulo operation.
ja: しかし、スウィフトでの負数に対するそれの挙動は、それが、厳密に言って、剰余（remainder）であり、モジュロ（modulo）演算でないのを意味します。

source: However, it’s important to understand where potential conflicts can occur, so you can avoid writing code that has conflicting access to memory.
ja: しかしながら、潜在的に衝突が起こり得るところを理解するのは重要です、そうすることであなたはメモリへのアクセスが衝突するコードを書くのを防止できます。

source: However, it’s possible to write code in which an instance of a class never gets to a point where it has zero strong references.
ja: しかしながら、あるクラスのあるインスタンスが、強い参照を１つも持たない状態になることが決してないコードを書くことは、可能です。

source: However, it’s sometimes useful to be able to store values of other types alongside these case values.
ja: しかし、他の型の値をこれらのケース節値の傍らに格納することができることは、時々役に立ちます。

source: However, it’s sometimes useful to enforce certain type constraints on the types that can be used with generic functions and generic types.
ja: しかし、総称体関数と総称体型で使われることができる型に、特定の型制約を強制することは、時々役に立ちます。

source: However, like all type aliases, Void is always a type—you can’t use it to write an empty tuple expression.
ja: しかしながら、すべての型エイリアスのように、Voidは常にある型です—あなたはそれを使って空のタプル式を書くことはできません。

source: However, loops and conditional statements can both use the break statement to end their execution prematurely.
ja: しかしながら、ループと条件文は、両方ともしかるべき時よりも早くそれらの実行を終えるためにbreak文を使うことができます。

source: However, multiple levels of optional chaining do not add more levels of optionality to the returned value.
ja: しかし、オプショナル連鎖の複数の階層は、返された値にさらにオプショナルの階層を加えません。

source: However, not every string can be converted into an integer.
ja: しかし、すべての文字列が、整数に変えられることができるというわけでありません。

source: However, properties can also be associated with the type itself.
ja: しかし、プロパティはまた、型それ自体に結び付けられることができます。

source: However, rather than two class instances, this time it’s a class instance and a closure that are keeping each other alive.
ja: しかし２つのクラスインスタンスではなく、今度は、それはお互いを生かし続けているクラスインスタンスとクロージャです。

source: However, remainder and multiplication have the same precedence as each other.
ja: しかしながら、剰余と乗算は、互いに同じ優先順位を持ちます。

source: However, semicolons are required if you want to write multiple separate statements on a single line:
ja: それにもかかわらず、セミコロンは必要とされます、もしあなたが１つの行に複数の別々の文を書きたい場合には：

source: However, superclass initializers are automatically inherited if certain conditions are met.
ja: しかし、スーパークラスのイニシャライザは、決まった条件が満たされるならば、自動的に継承されます。

source: However, that argument is now an inline closure.
ja: しかしながら、この引数は今では１つの行内クロージャです。

source: However, that property declaration can’t be implemented as a constant property or a read-only computed property.
ja: しかし、そのプロパティ宣言は、定数プロパティまたは読み出し専用の計算プロパティとして実装されることができません。

source: However, the width property of the original hd instance still has the old value of 1920:
ja: しかし、最初のhdインスタンスのwidthプロパティは、まだ1920の古い値を持ちます：

source: However, the fatalError(_:file:line:) function always halts execution, regardless of optimization settings.
ja: しかしながら、fatalError(_:file:line:)関数は常に実行を停止します、最適化設定に関係なく。

source: However, the && and || operators still operate on only two values, so this is actually three smaller expressions chained together.
ja: しかし、&&と||演算子は依然として２つの値だけに作用します、なのでこれは実際のところ１つに繋がれた３つのより小さい式です。

source: However, the access level for the numberOfEdits property is marked with a private(set) modifier to indicate that the property’s getter still has the default access level of internal, but the property is settable only from within code that’s part of the TrackedString structure.
ja: しかし、numberOfEditsプロパティのためのアクセス水準は、private(set)修飾子を使って印を付けられて、そのプロパティの持つゲッターが依然として省略時のアクセス水準の内部を持つ、しかしプロパティはTrackedString構造体の部分であるコード内からのみ設定可能であることを指し示します。

source: However, the actual answer is 17, not 5.
ja: しかしながら、実際の答えは17です、5ではなく。

source: However, the alternative example below is valid:
ja: しかし、これに代わる以下の例は有効です：

source: However, the conflicting access discussed here can happen on a single thread and doesn’t involve concurrent or multithreaded code.
ja: しかしながら、ここで議論するアクセス衝突は、単一スレッド上で起こることが可能で、並列またはマルチスレッドのコードを伴いません。

source: However, the cost of that flexibility is that some operations aren’t possible on the returned values.
ja: しかしながら、その柔軟性の対価は、いくつかの演算がその返される値の上で可能でないということです。

source: However, the emergency override password is known, so the overall compound expression still evaluates to true.
ja: しかし、非常用解除パスワードは知られているので、複合式全体はなおtrueと評価します。

source: However, the first line of swapTwoValues(_:_:) is slightly different from swapTwoInts(_:_:).
ja: しかし、swapTwoValues(_:_:)の最初の行は、わずかにswapTwoInts(_:_:)と異なります。

source: However, the function does not perform any safety checks on the array it is passed.
ja: しかし、この関数は、それが渡される配列に関してどんな安全確認も実行しません。

source: However, the initializer for Country cannot pass self to the City initializer until a new Country instance is fully initialized, as described in Two-Phase Initialization.
ja: しかし、Countryのためのイニシャライザは、selfをCityイニシャライザに渡すことが、新しいCountryインスタンスが完全に初期化されるまでできません、２段階初期化で記述されるように。

source: However, the method is still able to use type casting to query the type of the underlying instance.
ja: しかし、このメソッドは依然として基盤インスタンスの型についてたずねるために型キャストを使うことができます。

source: However, the projected value is true after trying to store a number that’s too large, like 55.
ja: しかしながら、予測値は、55のような大きすぎる数を格納しようとする後はtrueです。

source: However, the propagated error must be handled by some surrounding scope.
ja: しかしながら、伝えられるエラーは取り囲んでいるスコープの何れかによって処理される必要があります。

source: However, the read access to stepSize overlaps with the write access to number.
ja: しかしながら、stepSizeに対する読み出しアクセスはnumberに対する書き込みアクセスとオーバーラップします（重なります）。

source: However, the same letter can also be represented as a pair of scalars—a standard letter e (LATIN SMALL LETTER E, or U+0065), followed by the COMBINING ACUTE ACCENT scalar (U+0301).
ja: しかし、同じ文字はまた、一対のスカラー ― 通常の文字e（LATIN SMALL LETTER E、またはU+0065）、それに続けてCOMBINING ACUTE ACCENTスカラー（U+0301）として表わされることも出来ます。

source: However, the subclass must not be generic, and must not inherit from any generic classes.
ja: しかしながら、サブクラスは総称体である必要はありません、そして何らかの総称体クラスから継承する必要はありません。

source: However, the value of john.residence.address is currently nil.
ja: しかし、john.residence.addressの値は、現在はnilです。

source: However, there are several ways to access memory, called long-term accesses, that span the execution of other code.
ja: しかしながら、メモリにアクセスするための幾つかの方法、長期アクセスと呼ばれる、他のコードの実行の期間にまたがるいくつかのものがあります。

source: However, there is a third scenario, in which both properties should always have a value, and neither property should ever be nil once initialization is complete.
ja: しかし、第３の筋書きがあります、そこにおいて両方のプロパティは常に値を持たなければなりません、そして一旦初期化が終了しているならば、どちらのプロパティも決してnilであってはなりません。

source: However, there is an exception if the compilation condition includes a swift() platform condition: The statements are parsed only if the compiler’s version of Swift matches what is specified in the platform condition.
ja: しかしながら、例外があります、それはコンパイル条件がswift()プラットホーム条件を含む場合です：文はスウィフトのコンパイラのバージョンがプラットホーム条件において指定されるものと合致する場合にのみ構文解析されます。

source: However, there is no harm in using the gameLoop label with the continue statement.
ja: しかし、gameLoopラベルをcontinue文で使用することに害はありません。

source: However, there’s an important limitation to this approach: The flipped result exposes the exact generic types that were used to create it.
ja: しかしながら、重大な限界がこの取り組みにはあります：その裏返された結果は、それを作成するのに使われた正確な総称体型を露出します。

source: However, they can contain other string literals.
ja: しかしながら、それは、他の文字列リテラルを含むことができます。

source: However, this code always triggers a runtime error when residence is nil, as illustrated above.
ja: しかし、residenceがnilのとき、上で説明するように、このコードは常に実行時エラーの引き金となります。

source: However, this doesn’t mean that you have to specify the type of every constant and variable that you declare.
ja: しかし、これはあなたがすべてのあなたが宣言する定数と変数の型を指定しなければならないことを意味しません。

source: However, this is a rather long-winded way to write what is essentially a single-expression function (a > b).
ja: しかし、これは本質的に単一式の関数（a > b）であるものを書くには、相当に長たらしい方法です。

source: However, this means that they are not exactly the same as in C-based languages.
ja: しかし、これはCに基づく言語とそれらが厳密には同じでないことを意味します。

source: However, type properties are queried and set on the type, not on an instance of that type.
ja: しかし、型プロパティは、その型のインスタンスにではなく、その型に問い合わせられ設定されます。

source: However, unlike functions, subscripts can’t use in-out parameters.
ja: しかしながら、関数とは違い、添え字はin-outパラメータを使用できません。

source: However, unlike strings, you use substrings for only a short amount of time while performing actions on a string.
ja: しかしながら、文字列と違い、ある文字列に関して様々な行為を行う間の短いある程度の時間だけのために、あなたは下位文字列を使います。

source: However, unlike the value in that example, flip(_:) and join(_:_:) wrap the underlying types that the generic shape operations return in an opaque return type, which prevents those types from being visible.
ja: しかしながら、その例での値と違い、flip(_:)とjoin(_:_:)は基礎をなす型それらをラップします、それらは総称体の形状演算が不透明戻り型において返すものです、それはこれらの型が可視であるのを防ぎます。

source: However, using them to enforce valid data and state causes your app to terminate more predictably if an invalid state occurs, and helps make the problem easier to debug.
ja: しかしながら、それらを使って有効なデータと状態を遵守させることは、あなたのアプリに不正な状態が生じる場合により予測のつく結びとなるようにします、そして問題をより簡単にデバッグする助けとなります。

source: However, when oneAndTwo is used in a generic context or as an instance of the Loggable protocol, the specialized version isn’t used.
ja: しかしながら、oneAndTwoがある総称体文脈においてまたはLoggableプロトコルのインスタンスとして使われる場合、この特殊化版は使用されません。

source: However, when the tuples’ first elements are the same, their second elements are compared—this is what happens on the second and third line.
ja: しかしながら、タプルのもつ最初の要素が同じ場合、２番目の要素は比較されます — これが２番目と３番目の行で起こることです。

source: However, when there isn’t a meaningful relationship between them, it’s traditional to name them using single letters such as T, U, and V, such as T in the swapTwoValues(_:_:) function above.
ja: しかしながら、意味がある関係がそれらの間に無かった時、T、U、そしてVなどの一文字を使ってそれらに名前をつけるのが伝統的です、例えば上のswapTwoValues(_:_:)関数におけるTのように。
